L_shape/L_shape/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 573;

boundaryField
{
    inlet
    {
        type            fixedValue;
		value			uniform 573;
    }
    outlet
    {
        type    zeroGradient;  //inletoutlet
    }
    Wall_side
    {
        type    zeroGradient;
    }
    Wall_out
    {
        type    zeroGradient;
    }
    Wall_inside
    {
        type    zeroGradient;
    }



}


// ************************************************************************* //
