L_shape/L_shape/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
		//type			zeroGradient;
        type            fixedFluxPressure;
		value			uniform 0;
    }
    outlet
    {
		type            totalPressure;
        p0              uniform 0;
        //U               U;
        //rho             rho_0;
		
		
	    //type            fixedValue;
        //value           uniform 0;
		
	    //type            fixedFluxPressure;
		//value			uniform 0;
        //type            inletOutlet;  //outletInlet
		//inletValue		uniform 0;
    }
    Wall_side
    {
		type			zeroGradient;
    }
    Wall_out
    {
		type			zeroGradient;
    }
    Wall_inside
    {
		type			zeroGradient;
    }


}


// ************************************************************************* //
