L_shape/L_shape/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          150;
        startFace       48725;
    }
    outlet
    {
        type            patch;
        nFaces          150;
        startFace       48875;
    }
    Wall_out
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2025;
        startFace       49025;
    }
    Wall_side
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2300;
        startFace       51050;
    }
    Wall_inside
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1425;
        startFace       53350;
    }
)

// ************************************************************************* //
