L_shape/L_shape/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
   "rho.*"
   {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    }
    

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.01; 
    }


    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    pB
    {
        $p_rgh;
        tolerance       1e-05;
        relTol          0;
    }

    pBFinal
    {
        $pB;
        relTol          0;
    }

    "(U|B|h|R|e)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
    }

    T
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.01;
    }

   "(U|B|T|h|e|R)Final"
    {
        $U;
        relTol          0;
    } 
}

PIMPLE
{
    momentumPredictor yes;   //yes
    pRefCell	0;
    pRefValue	0;
    nCorrectors     3; 
    nNonOrthogonalCorrectors 0;
    nOuterCorrectors 1;
}

BPIMPLE
{
	 nCorrectors     3;
         nNonOrthogonalCorrectors 0;
	 nOuterCorrectors 1;
}

relaxationFactors
{
    fields
    {
        p           1;  // 0.3   1
    }
    equations
    {
        U               1;
        T               1;
    }
}

// ************************************************************************* //
